nc: 80  # 클래스 수
depth_multiple: 0.33  # 모델 깊이 배수 
width_multiple: 0.50  # 채널 수 배수 

anchors : 3

# 백본 네트워크: ResNet-50 FPN
backbone:
  # 기본 스템 (ResNet-50의 첫 번째 Conv 및 MaxPool 층)
  [[-1, 1, Focus, [64, 3]],  # Focus 모듈은 YOLOv5에서 사용되며, 비슷한 역할을 하는 층으로 간주
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 3, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],  # SPP 층은 FPN과 유사한 역할을 함
   [-1, 3, BottleneckCSP, [1024]]]

# 넥: FPN을 기반으로 한 유사 구조
neck:
  [[-1, 2, FPN, [256, 512, 1024]]]  # 각 피처 레벨에 대한 FPN 구성

# 헤드: YOLO 헤드 구조
head:
  [[-1, 1, Detect, [nc, anchors]]]  # nc는 클래스 수, anchors는 앵커 박스의 사이즈 및 비율을 나타냄